{
  "success": true,
  "data": [
    {
      "duration": "Feb, 2021 - Mar, 2025",
      "company": "ലൈറ്റ്‌ബ്രീസ് ഇൻഫോടെക്",
      "designation": "സീനിയർ സോഫ്റ്റ്‌വെയർ എഞ്ചിനീയർ",
      "location": "സ്മാർട്ട്സിറ്റി കൊച്ചി, ഇൻഫോപാർക്ക് റോഡ്, കാക്കനാട്, കേരളം, ഇന്ത്യ.",
      "experience": "4.1 വർഷം",
      "technologies": [
        "laravel",
        "aws lambda",
        "python",
        "docker",
        "elasticsearch",
        "redis",
        "mysql"
      ],
      "descriptions": [
        "ലാരാവെലും AWS ലാംഡയും ഉപയോഗിച്ച് വലിയ തോതിലുള്ള ആപ്ലിക്കേഷനുകൾക്കായി സ്കേലബിൾ ബാക്കെൻഡ് സിസ്റ്റങ്ങൾ രൂപകൽപ്പന ചെയ്യുകയും നടപ്പിലാക്കുകയും ചെയ്തു, 100 ദശലക്ഷത്തിലധികം രേഖകൾ കൈകാര്യം ചെയ്യുകയും സിസ്റ്റം കാര്യക്ഷമത വർദ്ധിപ്പിക്കുകയും ചെയ്തു.",
        "ദശലക്ഷക്കണക്കിന് രേഖകൾ കൈകാര്യം ചെയ്യാൻ Elasticsearch ഇൻഡെക്സിംഗ് ഒപ്റ്റിമൈസ് ചെയ്തു, ഡാറ്റ വീണ്ടെടുക്കൽ സമയം 40% കുറയ്ക്കുകയും വലിയ തോതിലുള്ള ആപ്ലിക്കേഷനുകൾക്കായി ചോദ്യങ്ങളുടെ പ്രകടനം മെച്ചപ്പെടുത്തുകയും ചെയ്തു.",
        "Docker ഉപയോഗിച്ച് കണ്ടെയ്‌നറൈസ്ഡ് ഡെവലപ്‌മെന്റ് എൻവയോൺമെന്റുകൾ സൃഷ്‌ടിക്കുകയും പരിപാലിക്കുകയും ചെയ്‌തു, ഡെവലപ്‌മെന്റ് വർക്ക്ഫ്ലോകൾ കാര്യക്ഷമമാക്കുകയും വിന്യാസ സ്ഥിരത മെച്ചപ്പെടുത്തുകയും ചെയ്‌തു.",
        "SOLID തത്വങ്ങൾ, PSR-12 മാനദണ്ഡങ്ങൾ, മികച്ച രീതികൾ എന്നിവ പാലിക്കുന്നുണ്ടെന്ന് ഉറപ്പാക്കാൻ കോഡ് അവലോകനങ്ങൾ നടത്തി.",
        "Google Drive-ശൈലിയിലുള്ള ക്ലൗഡ് സ്റ്റോറേജ് പ്ലാറ്റ്‌ഫോം നിർമ്മിക്കുന്നത് പോലുള്ള ഉപ-പ്രോജക്റ്റുകൾക്ക് നേതൃത്വം നൽകി, എൻഡ്-ടു-എൻഡ് ആർക്കിടെക്ചറും നടപ്പാക്കലും കൈകാര്യം ചെയ്തു.",
        "നിർണായകമായ ബിസിനസ് ലോജിക് എൻക്യാപ്സുലേറ്റ് ചെയ്യുന്ന പുനരുപയോഗിക്കാവുന്ന PHP പാക്കേജുകൾ വികസിപ്പിച്ചു, 90%+ ടെസ്റ്റ് കവറേജ് ഉറപ്പാക്കുകയും മെച്ചപ്പെട്ട കോഡ് മൊഡ്യൂലാരിറ്റിയിലൂടെ ഫീച്ചർ ഡെവലപ്‌മെന്റ് സമയം 25% കുറയ്ക്കുകയും ചെയ്തു.",
        "AI-സഹായത്തോടെയുള്ള കോഡിംഗ് ടൂളുകൾ (Codeium, Cursor IDE) ഡെവലപ്‌മെന്റ് വർക്ക്ഫ്ലോകൾ വേഗത്തിലാക്കാൻ ഉപയോഗിച്ചു, കോഡിന്റെ ഗുണനിലവാരം മെച്ചപ്പെടുത്തുകയും ഡെവലപ്‌മെന്റ് സമയം 30% കുറയ്ക്കുകയും ചെയ്തു."
      ]
    },
    {
      "duration": "Aug, 2018 - Feb, 2021",
      "company": "2ബേസ് ടെക്നോളജീസ്",
      "designation": "സോഫ്റ്റ്‌വെയർ എഞ്ചിനീയർ",
      "location": "പാലക്കാട്, കേരളം, ഇന്ത്യ",
      "experience": "2.5 വർഷം",
      "technologies": ["laravel", "scrapy", "python", "git"],
      "descriptions": [
        "ബാക്കെൻഡ് ആർക്കിടെക്ചർ, സംയോജനങ്ങൾ, ടീം സഹകരണം എന്നിവ കൈകാര്യം ചെയ്ത് രണ്ട് പ്രധാന പ്രോജക്റ്റുകൾക്ക് നേതൃത്വം നൽകുകയും വികസിപ്പിക്കുകയും ചെയ്തു.",
        "ഹോട്ടൽ, ഫ്ലൈറ്റ്, ആക്റ്റിവിറ്റി API-കൾ PayPal, PayUmoney പേയ്‌മെന്റ് ഗേറ്റ്‌വേകളുമായി സംയോജിപ്പിച്ച് ഒരു യാത്രാ ബുക്കിംഗ് പ്ലാറ്റ്‌ഫോം നിർമ്മിക്കുകയും സമാരംഭിക്കുകയും ചെയ്തു, പ്രതിമാസം ₹1 കോടിയിലധികം ഇടപാടുകൾ പ്രോസസ്സ് ചെയ്യുകയും പേയ്‌മെന്റ് വിജയ നിരക്ക് 25% വർദ്ധിപ്പിക്കുകയും ചെയ്തു.",
        "മൾട്ടി-ചാനൽ നോട്ടിഫിക്കേഷൻ സിസ്റ്റങ്ങൾ (ഇമെയിൽ, SMS, WhatsApp) നടപ്പിലാക്കി, തത്സമയ ഉപഭോക്തൃ ആശയവിനിമയം സാധ്യമാക്കുകയും ഉയർന്ന വിശ്വാസ്യതയോടെ പ്രതിദിനം 300-ൽ അധികം അറിയിപ്പുകൾ കൈകാര്യം ചെയ്യുകയും ചെയ്തു.",
        "Django, REST API-കൾ എന്നിവ ഉപയോഗിച്ച് IoT ആപ്ലിക്കേഷനായുള്ള ബാക്കെൻഡ് സംയോജിപ്പിച്ചു, 5 സെക്കൻഡിനുള്ളിൽ ഡാറ്റാ പുതുക്കൽ നിരക്കുകളുള്ള ഉപകരണങ്ങളിലുടനീളം തത്സമയ സെൻസർ നിരീക്ഷണം സാധ്യമാക്കി."
      ]
    },
    {
      "duration": "Jul, 2017 - Aug, 2018",
      "company": "ഫോർടിയസ് ടെക്നോളജീസ്",
      "designation": "വെബ് ഡെവലപ്പർ",
      "location": "അയ്യന്തോൾ, തൃശ്ശൂർ, കേരളം, ഇന്ത്യ",
      "experience": "1 വർഷം",
      "technologies": ["core-php", "codeigniter", "wordpress", "mysql"],
      "descriptions": [
        "Core PHP, CodeIgniter, WordPress എന്നിവ ഉപയോഗിച്ച് 25-ൽ അധികം CMS അടിസ്ഥാനമാക്കിയുള്ള വെബ് പ്രോജക്റ്റുകൾ ആരംഭിക്കുകയും വിതരണം ചെയ്യുകയും ചെയ്തു."
      ]
    }
  ]
}
