{
  "success": true,
  "data": [
    {
      "duration": "فبراير، 2021 - مارس، 2025",
      "company": "ليتبريز انفوتيك",
      "designation": "مهندس برمجيات كبير",
      "location": "سمارت سيتي كوتشي، طريق إنفوبارك، كاكاند، كيرالا، الهند.",
      "experience": "4.1 سنوات",
      "technologies": [
        "لارافيل",
        "لامدا أمازون",
        "بايثون",
        "دوكر",
        "إلاستيك سيرش",
        "ريدز",
        "ماي إس كيو إل"
      ],
      "descriptions": [
        "صمم وimplemented أنظمة الخلفية القابلة للتوسع لapplications كبيرة النطاق باستخدام لارافيل ولامدا أمازون، إدارة أكثر من 100 مليون وثيقة وتحسين كفاءة النظام.",
        "أوضح فهرسة إلاستيك سيرش لإدارة ملايين الوثائق، مما قلل من وقت استرجاع البيانات بنسبة 40% وتحسين أداء الاستعلامات لapplications كبيرة النطاق.",
        "أنشأ وصيانة بيئات تطوير معقمة باستخدام دوكر، مما سهل سير عمل التطوير وتحسين توافق النشر.",
        "أجرى مراجعات الكود لضمان الالتزام بمبادئ SOLID ومعايير PSR-12 وأفضل الممارسات.",
        "أخرج مشاريع فرعية مثل بناء منصة تخزين سحابية على غرار جوجل درايف، إدارة هندسة النهاية إلى النهاية والتنفيذ.",
        "طور حزم PHP قابلة لإعادة الاستخدام لتضمين المنطق التجاري الحرج، مما ضمن تغطية اختبار 90%+ وتقليل وقت تطوير الميزات بنسبة 25% من خلال تحسين وحداتية الكود.",
        "استخدم أدوات الترميز المساعدة بالذكاء الاصطناعي (كوديوم، كيرسور IDE) لتعجيل سير عمل التطوير، مما تحسن جودة الكود وقطع وقت التطوير بنسبة 30%"
      ]
    },
    {
      "duration": "أغسطس، 2018 - فبراير، 2021",
      "company": "2Base Technologies",
      "designation": "مهندس برمجيات",
      "location": "بالاكاد، كيرالا، الهند",
      "experience": "2.5 سنوات",
      "technologies": ["لارافيل", "سكاربي", "بايثون", "جيت"],
      "descriptions": [
        "قاد وتطوير两个 مشروع رئيسي، إدارة هندسة الخلفية والدمج والتعاون الفريق.",
        "بنى واطلق منصة حجز سفر متكاملة بتكاملات API الفنادق والرحلات والأنشطة مع بوابات دفع PayPal وPayUmoney، معالجة أكثر من ₹1 كروة في المعاملات الشهرية وتحسين معدلات النجاح للدفعات بنسبة 25%.",
        "نفذ أنظمة إخطار متعددة القنوات (البريد الإلكتروني، الرسائل القصيرة، واتساب)، مما مكن من التواصل مع العملاء في الوقت الفعلي ومعالجة أكثر من 300 إخطار يومياً مع موثوقية عالية.",
        "دمج الخلفية لطبيق IoT باستخدام دجنجو وAPIs REST، مما مكن من مراقبة أجهزة الاستشعار في الوقت الفعلي عبر الأجهزة مع معدلات تحديث البيانات أقل من 5 ثواني."
      ]
    },
    {
      "duration": "يوليو، 2017 - أغسطس، 2018",
      "company": "Fortius Technologies",
      "designation": "مطور ويب",
      "location": "أياثول، ثريسور، كيرالا، الهند",
      "experience": "1 سنة",
      "technologies": ["core-php", "كوديجنتر", "ووردبريس", "ماي إس كيو إل"],
      "descriptions": [
        "شروع وتسليم أكثر من 25 مشروع ويب قائم على نظام إدارة المحتوى باستخدام Core PHP، كوديجنتر، وووردبريس."
      ]
    }
  ]
}
